#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+options: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+options: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t tags:t
#+options: tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+title: Day 2: Rock paper scissors tournament
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 28.1 (Org mode 9.5.2)
#+cite_export:

[[file:../01/day1.org][As for the first day]], this file is accompanied by the tangled programs, but can
also be executed directly inside Emacs.

This time, the code includes some third-party libraries for making very simple
operations less tedious. Be sure to load or install them beforehand.

** Input sanitation is important
The above code is logically correct but, unfortunately, there is a
showstopper. Try to execute the following code:
#+begin_src emacs-lisp :tangle no :results value pp :exports both
  ;; Drop lines until one of length =/= 3 appears, then return all of them
  (seq-drop-while
   (lambda (l) (= l 3))
   (seq-map
    'length
    (split-string
     (f-read-bytes "input2.txt")
     "\n")))
#+end_src

#+RESULTS:
: (0)

Yes, there is a line of length 0. This is because the input has a closing =\n=,
which produces a =""= string in the list. The laziest (and most efficient) way
to address this issue is by including a mapping for =""= of value 0 in the
lookup table:
#+name: hash-table-definition
#+begin_src emacs-lisp :tangle no
  ;; Lookup table for round-to-score conversion
  #s(hash-table test equal
                size 10
                data ("A X" 4 "B X" 1 "C X" 7
                      "A Y" 8 "B Y" 5 "C Y" 2
                      "A Z" 3 "B Z" 9 "C Z" 6
                      ;; Ignore empty lines
                      "" 0))
#+end_src

Another alternative would be to filter all lines of length 0 with
an s-expression like:
#+begin_src emacs-lisp :tangle no
  (seq-filter (lambda (l) (> l 0)) ...)
#+end_src

